benchmark_results/container_logs/cassandra-client-load.log
======================================================
server IP: localhost
Database record count: 5000000
Target load: 5000 rps
Loader threads count: 4
Opeartion count: 300000
Make sure you have run the warmup.sh before loading the server, and use the same record count here.
======================================================
/usr/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.CassandraCQLClient -p hosts=localhost -P /ycsb/workloads/workloada -p recordcount=5000000 -p operationcount=300000 -threads 4 -target 5000 -s
Command line: -t -db site.ycsb.db.CassandraCQLClient -p hosts=localhost -P /ycsb/workloads/workloada -p recordcount=5000000 -p operationcount=300000 -threads 4 -target 5000 -s
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2024-12-02 13:59:14:307 0 sec: 0 operations; est completion in 0 second 
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by io.netty.util.internal.PlatformDependent0 (file:/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar) to field java.nio.Buffer.address
WARNING: Please consider reporting this to the maintainers of io.netty.util.internal.PlatformDependent0
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Dec 02, 2024 1:59:14 PM io.netty.util.internal.PlatformDependent <clinit>
INFO: Your platform does not provide complete low-level API for accessing direct buffers reliably. Unless explicitly requested, heap buffer will always be preferred to avoid potential system unstability.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2024-12-02 13:59:24:271 10 sec: 46313 operations; 4630.84 current ops/sec; est completion in 55 seconds [READ: Count=23278, Max=39039, Min=273, Avg=575.06, 90=680, 99=1471, 99.9=4275, 99.99=33599] [UPDATE: Count=23073, Max=37471, Min=211, Avg=444.53, 90=517, 99=993, 99.9=5175, 99.99=20239] 
2024-12-02 13:59:34:269 20 sec: 96307 operations; 4999.9 current ops/sec; est completion in 43 seconds [READ: Count=24994, Max=15327, Min=269, Avg=499.5, 90=562, 99=625, 99.9=837, 99.99=14991] [UPDATE: Count=24979, Max=15319, Min=221, Avg=404.86, 90=463, 99=537, 99.9=667, 99.99=13503] 
2024-12-02 13:59:44:269 30 sec: 146308 operations; 5000.1 current ops/sec; est completion in 32 seconds [READ: Count=24935, Max=14903, Min=280, Avg=473.13, 90=536, 99=601, 99.9=769, 99.99=14671] [UPDATE: Count=25060, Max=14679, Min=230, Avg=388.15, 90=440, 99=509, 99.9=623, 99.99=12807] 
2024-12-02 13:59:54:269 40 sec: 196308 operations; 5000 current ops/sec; est completion in 22 seconds [READ: Count=25019, Max=30559, Min=284, Avg=476.69, 90=541, 99=607, 99.9=813, 99.99=16591] [UPDATE: Count=24987, Max=392191, Min=210, Avg=452.08, 90=447, 99=529, 99.9=736, 99.99=391679] 
2024-12-02 14:00:04:270 50 sec: 246309 operations; 5000.1 current ops/sec; est completion in 11 seconds [READ: Count=25062, Max=22127, Min=308, Avg=476.71, 90=536, 99=598, 99.9=805, 99.99=16991] [UPDATE: Count=24935, Max=22047, Min=235, Avg=391.09, 90=445, 99=511, 99.9=691, 99.99=17263] 
2024-12-02 14:00:14:269 60 sec: 296308 operations; 4999.9 current ops/sec; est completion in 1 second [READ: Count=24923, Max=20239, Min=302, Avg=485.44, 90=552, 99=620, 99.9=721, 99.99=18511] [UPDATE: Count=25077, Max=20447, Min=219, Avg=400.45, 90=460, 99=533, 99.9=605, 99.99=17295] 
2024-12-02 14:00:17:248 62 sec: 300000 operations; 1239.76 current ops/sec; [READ: Count=1812, Max=2381, Min=283, Avg=480.99, 90=547, 99=602, 99.9=660, 99.99=2381] [CLEANUP: Count=4, Max=2238463, Min=2, Avg=559368.5, 90=2238463, 99=2238463, 99.9=2238463, 99.99=2238463] [UPDATE: Count=1866, Max=2111, Min=229, Avg=394.93, 90=451, 99=520, 99.9=1972, 99.99=2111] 
[OVERALL], RunTime(ms), 62977
[OVERALL], Throughput(ops/sec), 4763.64386998428
[TOTAL_GCS_G1_Young_Generation], Count, 5
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 83
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.13179414706956508
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 83
[TOTAL_GC_TIME_%], Time(%), 0.13179414706956508
[READ], Operations, 150023
[READ], AverageLatency(us), 496.67262353105855
[READ], MinLatency(us), 269
[READ], MaxLatency(us), 39039
[READ], 95thPercentileLatency(us), 597
[READ], 99thPercentileLatency(us), 761
[READ], Return=OK, 150023
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 559368.5
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 2238463
[CLEANUP], 95thPercentileLatency(us), 2238463
[CLEANUP], 99thPercentileLatency(us), 2238463
[UPDATE], Operations, 149977
[UPDATE], AverageLatency(us), 412.88843622688813
[UPDATE], MinLatency(us), 210
[UPDATE], MaxLatency(us), 392191
[UPDATE], 95thPercentileLatency(us), 493
[UPDATE], 99thPercentileLatency(us), 571
[UPDATE], Return=OK, 149977